<?php
defined('BASEPATH') OR exit('No direct script access allowed');

class Home extends CI_Controller {

	public function __construct()
	{
		parent::__construct();

		$this->load->helper(array('url'));
		if (isset($_SESSION['ses_company_data'])) {
			redirect('/cabinet', 'refresh');//делаем редирект
		}
		$this->load->helper('cookie');
		$this->load->library('user_agent');
		$this->load->model('Company_model', 'CModel');
	}
	public function index()
	{
		$white_list = array(
			"95.217.115.131","83.96.242.167","54.38.193.54","178.155.6.128", "95.217.227.133", "135.181.79.198", "135.181.79.197", "95.217.115.135", "95.217.227.130", "95.217.228.244", "95.217.229.13", "95.217.115.132", "95.217.227.133", "95.217.115.136", "135.181.15.189", "95.217.227.70", "95.217.197.199", "95.217.227.75", "95.217.197.198", "95.217.194.74", "135.181.9.94", "46.17.105.145", "46.17.105.151", "46.17.105.174", "46.17.105.209", "46.17.105.213", "46.17.105.219", "46.17.105.222", "46.17.105.237", "46.17.105.238", "185.252.144.49", "185.252.144.52", "185.252.144.63", "185.252.144.111", "185.252.144.83", "185.252.144.96", "185.252.144.107", "185.252.144.110", "185.252.144.111", "185.252.144.125", "185.252.144.58", "185.252.144.128", "185.252.144.146", "185.252.144.190", "185.252.144.197", "185.252.144.205", "185.252.144.208", "185.252.144.230", "185.252.144.245", "46.17.105.7", "185.252.144.135", "46.17.105.12", "46.17.105.20", "46.17.105.32", "46.17.105.63", "46.17.105.192", "46.17.105.193", "46.17.105.194", "46.17.105.195", "46.17.105.196", "46.17.105.18", "46.17.105.236", "91.217.76.68", "91.217.76.99", "91.217.76.101", "91.217.76.102", "91.217.76.105", "91.217.76.106", "91.217.76.107", "91.217.76.108", "185.117.119.168", "185.252.144.44", "91.217.76.215", "91.217.76.214", "91.217.76.213", "91.217.76.211", "91.217.76.210", "91.217.76.209", "91.217.76.215", "91.217.76.214", "91.217.76.213", "91.217.76.211", "91.217.76.210", "91.217.76.209", "91.217.76.208", "46.17.105.176", "91.217.76.101", "91.217.76.102", "91.217.76.105", "91.217.76.106", "91.217.76.107", "91.217.76.108", "185.117.119.168", "185.252.144.44", "46.17.105.193", "46.17.105.194", "46.17.105.195", "46.17.105.196", "46.17.105.18", "46.17.105.236", "91.217.76.68", "91.217.76.99", "185.252.144.245", "46.17.105.7", "185.252.144.135", "46.17.105.12", "46.17.105.20", "46.17.105.32", "46.17.105.63", "46.17.105.192", "185.252.144.58", "185.252.144.128", "185.252.144.146", "185.252.144.190", "185.252.144.197", "185.252.144.205", "185.252.144.208", "185.252.144.230", "95.217.197.199"
		);
		$this->load->helper('cookie');
//		if($cnt = @file_get_contents('./application/json/hosts.json')) {
//			$json = json_decode($cnt, true);
//			foreach ($json as $key => $arr) {
//				if($_SERVER['SERVER_NAME'] == $arr['host']) {
//					$config['json'] = $arr;
//					$config['host'] = 'revicare-beauty.com';
//					break;
//				}
//			}
//		}
//		$refers = $config['json']['refers'];
//		if (isset($_GET['from'])) {
//			if (array_key_exists($_GET['from'], $refers)) {
//				set_cookie('from', $refers[$_GET['from']], 43200);
//				redirect('/', 'refresh');
//			}
//
//		}



		$cookie = get_cookie('view_get1free');
		if ($cookie === NULL) {
			set_cookie('view_get1free', '1', 43200);
			$this->CModel->add_view($_SERVER['REMOTE_ADDR'], $_SERVER['HTTP_HOST']);
		}



		$config_site = $this->CModel->get_info_site();
		$data = [
			'title' => $_SERVER['HTTP_HOST'],
			'config_site' => $config_site,
			'all_site_product' => $this->CModel->all_site_product($config_site['id']),
		];

		if ($this->agent->is_mobile())
		{
			$this->load->view('site/' .$_SERVER['HTTP_HOST']. '/mobile', $data);
		}else{
			$this->load->view('site/' .$_SERVER['HTTP_HOST']. '/pc', $data);
		}
//


	}




	public function logout()
	{
		if (isset($_COOKIE[session_name()]))//проверяем - есть ли кука относящаяся к этой сессии в браузере
		{
			setcookie(session_name(), '', time() - 42000, '/'); //удаляем куку с именем сессии
		}
		// рвем сессию
		$this->session->sess_destroy();

		redirect(base_url(), 'location', 301);//делаем редирект
	}
}
